var add = require('../lib/add')
var assert = require('assert');
describe('大数相加add方法', function () {
  it('字符串"42329"加上字符串"21532"等于"63861"', function () {
    add('42329', '21532')
      .should.equal('63861')
  })

  it('"843529812342341234"加上"236124361425345435"等于"1079654173767686669"', function () {
    add('843529812342341234', '236124361425345435')
      .should.equal('1079654173767686669')
  })

  it('"999999999999999999999999999999"加上"999999999999999999999999999999"等于"1079654173767686669"', function () {
    add('999999999999999999999999999999', '999999999999999999999999999999')
      .should.equal('1999999999999999999999999999998')
  })


  it('可以捕获并验证函数add的错误', function () {
    let addFun = function () {
      add('m', '1');
    }
    assert.throws(
      addFun,
      /value/
    );

  })

})

